brew "stow"

# gnubin
brew "bash"
brew "git"
brew "bash-completion@2"
brew "coreutils"
brew "findutils"
brew "gawk"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "gnu-getopt"
brew "grep"
brew "gzip"
brew "less"
brew "make"
brew "watch"
brew "wget"
brew "zip"
brew "llvm"
brew "openssl"

# dev fonts
cask "font-jetbrains-mono-nerd-font"
cask "font-jetbrains-mono"

# base shell setup
brew "starship"

brew "tmux"

# cmd tools
brew "the_silver_searcher"
brew "bat"
brew "neovim"
brew "awscli"
brew "jq"
brew "stripe/stripe-cli/stripe"
brew "terraform-docs"
brew "tfenv"
brew "opentofu"
brew "docker-compose"
brew "k6"
brew "shfmt"
brew "shellcheck"

brew "gh"
brew "graphviz"
brew "gnuplot"
brew "imagemagick"
brew "ffmpeg"
brew "trivy"

brew "kubectx"
brew "croc"

cask "mysqlworkbench"
cask "ghostty"
cask "firefox@developer-edition"

brew "duckdb"
